app/controllers/likes_controller.rb

INSERT INTO "likes" ("post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["post_id", 2], ["user_id", 1], ["created_at", "2021-04-13 23:28:33.118791"], ["updated_at", "2021-04-13 23:28:33.118791"]]
---
  def create
    @like = current_user.likes.build(like_params)
    # buildメソッドを使って、インスタンスを作成する。
    @post = @like.post
    # postメソッドはgetメソッドと同じこと役割で、情報を取得する際に使う。
    # ここでは、@likeに紐づく、post_id(いいねを押した投稿のid)とuser_id(現在サインインしているユーザーのid)の情報を取得する。
    # @postは、どの投稿にいいねを押したかを判断するために、ビュー作成時に使用する。
    if @like.save

SELECT "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]
---
  def destroy
    @like = Like.find_by(id: params[:id])
    # 受け取ったHTTPリクエストから、idを判別し、指定のレコード1つを@likeに代入している。
    @post = @like.post
    if @like.destroy