app/controllers/posts_controller.rb

INSERT INTO "photos" ("image", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["image", "kawhi_lwonard.jpg"], ["post_id", 1], ["created_at", "2021-05-01 04:19:44.257747"], ["updated_at", "2021-05-01 04:19:44.257747"]]
INSERT INTO "posts" ("caption", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["caption", ""], ["user_id", 1], ["created_at", "2021-05-01 04:19:44.221606"], ["updated_at", "2021-05-01 04:19:44.221606"]]
---
  def create
    @post = Post.new(post_params)
    if @post.photos.present?
      @post.save

SELECT "photos".* FROM "photos" WHERE "photos"."post_id" IN (?, ?)  [["post_id", 2], ["post_id", 1]]
SELECT "posts".* FROM "posts" ORDER BY created_at DESC LIMIT ?  [["LIMIT", 10]]
---
  def index
    @posts = Post.limit(10).includes(:photos, :user).order('created_at DESC')

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    if @post.user == current_user
      flash[:notice] = "投稿が削除されました" if @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_post
      @post = Post.find_by(id: params[:id])