app/models/post.rb

  def liked_by(current_user)
    Like.find_by(user_id: user.id, post_id: id)
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."post_id" = ? LIMIT ?  [["user_id", 1], ["post_id", 2], ["LIMIT", 1]]